trade_exp/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПорядокРасчетов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="27ca6d68-e67a-4889-9637-02a127ea6bb7">
    <name>ПоЗаказам</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4f954f84-d9f9-4d34-8b96-cd90db36a2c4">
    <name>ПоДоговорамНакладным</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/CommonModules/ДенежныеСредстваСервер/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти
&ИзменениеИКонтроль("ПроверитьЗаполнитьДоговор")
Процедура Док_ПроверитьЗаполнитьДоговор(ДанныеДокумента, ИдентификаторСтроки) Экспорт

	Если Не ЭтоХозяйственнаяОперацияОплатыПоРасчетам(ДанныеДокумента.ХозяйственнаяОперация) Тогда
		Возврат;
	КонецЕсли;

	СуммаНеРаспределено = НераспределенныйОстатокПлатежа(ДанныеДокумента);

	Если СуммаНеРаспределено = 0 Тогда
		Если ДанныеДокумента.РасшифровкаПлатежа.Количество() >= 1 Тогда
			МассивОбъектовРасчетов = ДанныеДокумента.РасшифровкаПлатежа.Выгрузить(,"ОбъектРасчетов").ВыгрузитьКолонку("ОбъектРасчетов");
			МассивОбъектовРасчетов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивОбъектовРасчетов);
			УстановитьПривилегированныйРежим(Истина);
			ДоговорыОбъектовРасчетов = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
				МассивОбъектовРасчетов,
				"Договор");
			МассивДоговоров = ОбщегоНазначенияУТКлиентСервер.ПреобразоватьСоответствиеИлиСтруктуруВМассив(ДоговорыОбъектовРасчетов, Ложь);
			// Если есть пустые объекты расчетов, то договор в шапке не нужно заполнять единственным заполненным, добавим пустой договрр в массив
			Для Каждого ОбъектРасчетов Из МассивОбъектовРасчетов Цикл
				Если Не ЗначениеЗаполнено(ОбъектРасчетов) Тогда
					МассивДоговоров.Добавить(ПустоеЗначениеДоговораПоОперации(ДанныеДокумента.ХозяйственнаяОперация));
				КонецЕсли;
			КонецЦикла;
			МассивДоговоров = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивДоговоров);
			ПорядкиРасчетовДоговоров = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(
				МассивДоговоров,
				"ПорядокРасчетов");
			УстановитьПривилегированныйРежим(Ложь);

			Если МассивДоговоров.Количество() = 1 Тогда

				ПорядокРасчетовДоговора =
					?(ДанныеДокумента.Договор = Неопределено,
					Перечисления.ПорядокРасчетов.ПустаяСсылка(),
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Договор, "ПорядокРасчетов"));

				Если ЗначениеЗаполнено(МассивДоговоров[0])
					Или (Не ЗначениеЗаполнено(МассивДоговоров[0])
					И (ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
					Или ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным)) Тогда
					ДанныеДокумента.Договор = МассивДоговоров[0];
				КонецЕсли;

			ИначеЕсли ДанныеДокумента.СуммаДокумента <> 0 Тогда
				ДанныеДокумента.Договор = Неопределено;
			КонецЕсли;

			Если ИдентификаторСтроки <> Неопределено Тогда
				СтрокаРасшифровки = ДанныеДокумента.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтроки);
				УстановитьПривилегированныйРежим(Истина);
				ПорядокРасчетовДоговора =
					?(СтрокаРасшифровки.Договор = Неопределено,
					Перечисления.ПорядокРасчетов.ПустаяСсылка(),
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасшифровки.Договор, "ПорядокРасчетов"));
				УстановитьПривилегированныйРежим(Ложь);
				Если (ДоговорыОбъектовРасчетов[СтрокаРасшифровки.ОбъектРасчетов] <> СтрокаРасшифровки.Договор
					Или Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов))
					И (ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
						Или ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) Тогда
					// Если в других строках был заполнен один договор, то необходимо очистить договор шапки
					Если МассивДоговоров.Количество() = 1
						И Не ЗначениеЗаполнено(МассивДоговоров[0]) Тогда
						ДанныеДокумента.Договор = Неопределено;
					КонецЕсли;
					// Очистим договор в табличной части
					СтрокаРасшифровки.Договор = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		ОбъектыРасчетов = ОбъектыРасчетовСервер.ВсеОбъектыРасчетовПоСсылке(ДанныеДокумента.Ссылка);
		Если ЗначениеЗаполнено(ДанныеДокумента.Договор) Тогда
			УстановитьПривилегированныйРежим(Истина);
			ПорядокРасчетовДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДокумента.Договор, "ПорядокРасчетов");
			УстановитьПривилегированныйРежим(Ложь);
			Если (ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
				Или ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) Тогда
				#Удаление
				ДанныеДокумента.Договор = Неопределено;
				#КонецУдаления
				
				#Вставка
				Если НЕ ТипЗнч(ДанныеДокумента.ДокументОснование) = Тип("ДокументСсылка.АрендаНоменклатуры") Тогда
					ДанныеДокумента.Договор = Неопределено;
				КонецЕсли;
				#КонецВставки
				
				Если ИдентификаторСтроки <> Неопределено Тогда
					СтрокаРасшифровки = ДанныеДокумента.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтроки);
					Если Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
						Или ОбъектыРасчетов.Найти(СтрокаРасшифровки.ОбъектРасчетов) <> Неопределено Тогда
						СтрокаРасшифровки.Договор = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если ИдентификаторСтроки <> Неопределено Тогда
			СтрокаРасшифровки = ДанныеДокумента.РасшифровкаПлатежа.НайтиПоИдентификатору(ИдентификаторСтроки);
			Если ЗначениеЗаполнено(СтрокаРасшифровки.Договор) Тогда
				УстановитьПривилегированныйРежим(Истина);
				ПорядокРасчетовДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаРасшифровки.Договор, "ПорядокРасчетов");
				УстановитьПривилегированныйРежим(Ложь);
				Если (Не ЗначениеЗаполнено(СтрокаРасшифровки.ОбъектРасчетов)
					Или ОбъектыРасчетов.Найти(СтрокаРасшифровки.ОбъектРасчетов) <> Неопределено)
						И (ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов
							Или ПорядокРасчетовДоговора = Перечисления.ПорядокРасчетов.ПоДоговорамНакладным) Тогда
						СтрокаРасшифровки.Договор = Неопределено;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Перед ("УстановитьПрефиксИнформационнойБазыИКассовойКнигиНомеруДокументаПриУстановкеНовогоНомера")
Процедура Док_УстановитьПрефиксИнформационнойБазыИКассовойКнигиНомеруДокументаПриУстановкеНовогоНомера(Источник, СтандартнаяОбработка, Префикс) Экспорт
	УстановитьПривилегированныйРежим(истина);
	Если Источник.ЭтоНовый() Тогда
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		     ОбновитьНумерациюОбъектов(Метаданные.Документы.ПриходныйКассовыйОрдер);
		иначеесли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
			 ОбновитьНумерациюОбъектов(Метаданные.Документы.РасходныйКассовыйОрдер);
		 конецесли;	
	конецесли;	
КонецПроцедуры
